"Dismiss" = "Отклонить";
"Images that arrive on your iPod through Mover are automatically saved to the saved pictures album inside your iPod's Pictures application." = "Изображения, которые прибыли на Ваш iPhod через Mover, автоматически сохраняются в Фотографиях.";
"An image has been received. It has been saved automatically." = "Получено новое изображение. Сохранено автоматически.";
